### Terraform Plan 📋

#### Format: `failure`
#### Init: `success`
#### Validate: `success`
#### Plan: `success`

<details><summary>Show Plan</summary>

```terraform
module.compute.random_password.admin: Refreshing state... [id=none]
module.github_oidc.azuread_application.github_actions: Refreshing state... [id=/applications/2d5b45e1-89d4-4bf4-888a-88ca6c6fdf18]
module.github_oidc.azuread_application_federated_identity_credential.github_main: Refreshing state... [id=2d5b45e1-89d4-4bf4-888a-88ca6c6fdf18/federatedIdentityCredential/1f4c8cd6-fcdf-42cf-bf11-cb30bfb431bf]
module.github_oidc.azuread_application_federated_identity_credential.github_pr: Refreshing state... [id=2d5b45e1-89d4-4bf4-888a-88ca6c6fdf18/federatedIdentityCredential/0ffa5be8-081f-41b4-b670-ae221e2d7e6e]
module.github_oidc.azuread_application_federated_identity_credential.github_environment_production: Refreshing state... [id=2d5b45e1-89d4-4bf4-888a-88ca6c6fdf18/federatedIdentityCredential/55e0ef59-0c2b-4310-bf0b-c03f5635841a]
module.github_oidc.azuread_service_principal.github_actions: Refreshing state... [id=/servicePrincipals/c305955f-d4f8-40b1-a356-9427f4495177]
module.defender.data.azurerm_subscription.current: Reading...
module.defender.azurerm_security_center_subscription_pricing.storage: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Security/pricings/StorageAccounts]
module.defender.azurerm_security_center_subscription_pricing.vms: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Security/pricings/VirtualMachines]
module.defender.azurerm_security_center_contact.main: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Security/securityContacts/default]
module.defender.azurerm_security_center_subscription_pricing.keyvaults: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Security/pricings/KeyVaults]
module.github_oidc.data.azurerm_subscription.current: Reading...
data.azurerm_subscription.current: Reading...
module.governance.data.azurerm_subscription.current: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2]
module.defender.azurerm_security_center_subscription_pricing.arm: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Security/pricings/Arm]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.OperationalInsights/workspaces/log-personal-dev-eastus2]
module.networking.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/virtualNetworks/vnet-personal-dev-eastus2]
module.github_oidc.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c]
module.networking.azurerm_network_security_group.default: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/networkSecurityGroups/nsg-default-dev-eastus2]
module.governance.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c]
module.compute.azurerm_public_ip.vm: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/publicIPAddresses/pip-vm-personal-dev-eastus2]
data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c]
module.github_oidc.azurerm_role_assignment.storage_blob_contributor: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Authorization/roleAssignments/ec1fb9b3-376b-2103-ebdd-5c5c7bc80c17]
module.defender.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c]
module.github_oidc.azurerm_role_assignment.contributor: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Authorization/roleAssignments/051f3f4d-2598-b819-1f29-f02696f0efd0]
module.github_oidc.azurerm_role_assignment.keyvault_secrets_officer: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Authorization/roleAssignments/b7f2a67e-cf4e-00b5-d5bd-345a88580541]
module.github_oidc.azurerm_role_assignment.user_access_admin: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Authorization/roleAssignments/4c92f2fe-e136-2690-8015-9fc645026f17]
module.governance.azurerm_subscription_policy_assignment.require_env_tag_rg: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Authorization/policyAssignments/require-environment-tag-rg]
module.governance.azurerm_subscription_policy_assignment.inherit_managed_by_tag: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Authorization/policyAssignments/inherit-managed-by-tag]
module.governance.azurerm_subscription_policy_assignment.inherit_env_tag: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Authorization/policyAssignments/inherit-environment-tag]
module.governance.azurerm_subscription_policy_assignment.allowed_vm_skus[0]: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Authorization/policyAssignments/allowed-vm-skus]
module.governance.azurerm_subscription_policy_assignment.allowed_locations: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Authorization/policyAssignments/allowed-locations]
module.governance.azurerm_subscription_policy_assignment.require_managed_by_tag_rg: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Authorization/policyAssignments/require-managed-by-tag-rg]
module.governance.azurerm_subscription_policy_assignment.secure_transfer_storage: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Authorization/policyAssignments/require-secure-transfer-storage]
azurerm_consumption_budget_subscription.monthly: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/providers/Microsoft.Consumption/budgets/budget-personal-dev-monthly]
module.networking.azurerm_subnet.default: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/virtualNetworks/vnet-personal-dev-eastus2/subnets/snet-default-dev-eastus2]
module.networking.azurerm_network_security_rule.deny_all_inbound: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/networkSecurityGroups/nsg-default-dev-eastus2/securityRules/DenyAllInbound]
module.keyvault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.KeyVault/vaults/kv-personal-dev-eus2]
module.networking.azurerm_monitor_diagnostic_setting.vnet: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/virtualNetworks/vnet-personal-dev-eastus2|diag-vnet-personal-dev-eastus2]
module.networking.azurerm_monitor_diagnostic_setting.nsg: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/networkSecurityGroups/nsg-default-dev-eastus2|diag-nsg-default-dev-eastus2]
module.networking.azurerm_subnet_network_security_group_association.default: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/virtualNetworks/vnet-personal-dev-eastus2/subnets/snet-default-dev-eastus2]
module.compute.azurerm_network_interface.vm: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/networkInterfaces/nic-vm-personal-dev-eastus2]
module.compute.azurerm_network_security_rule.allow_rdp: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/networkSecurityGroups/nsg-default-dev-eastus2/securityRules/AllowRDP-vm-personal-dev-eastus2]
module.compute.azurerm_monitor_diagnostic_setting.nic: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/networkInterfaces/nic-vm-personal-dev-eastus2|diag-nic-vm-personal-dev-eastus2]
module.keyvault.azurerm_role_assignment.kv_admin: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.KeyVault/vaults/kv-personal-dev-eus2/providers/Microsoft.Authorization/roleAssignments/0791d56c-045e-c4f6-4e32-2dccdbd40700]
module.keyvault.azurerm_monitor_diagnostic_setting.kv: Refreshing state... [id=/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.KeyVault/vaults/kv-personal-dev-eus2|diag-kv-personal-dev-eus2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute.azurerm_dev_test_global_vm_shutdown_schedule.this will be created
  + resource "azurerm_dev_test_global_vm_shutdown_schedule" "this" {
      + daily_recurrence_time = "1900"
      + enabled               = true
      + id                    = (known after apply)
      + location              = "eastus2"
      + tags                  = {
          + "cost_center" = "personal"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "matt.bouges@gmail.com"
          + "project"     = "personal"
        }
      + timezone              = "Central Standard Time"
      + virtual_machine_id    = (known after apply)

      + notification_settings {
          + enabled         = false
          + time_in_minutes = 30
        }
    }

  # module.compute.azurerm_key_vault_secret.admin_password will be created
  + resource "azurerm_key_vault_secret" "admin_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.KeyVault/vaults/kv-personal-dev-eus2"
      + name                    = "vm-personal-dev-eastus2-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.compute.azurerm_windows_virtual_machine.this will be created
  + resource "azurerm_windows_virtual_machine" "this" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureadmin"
      + allow_extension_operations                             = (known after apply)
      + automatic_updates_enabled                              = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "dev-ide"
      + disk_controller_type                                   = (known after apply)
      + enable_automatic_updates                               = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = (known after apply)
      + id                                                     = (known after apply)
      + location                                               = "eastus2"
      + max_bid_price                                          = -1
      + name                                                   = "vm-personal-dev-eastus2"
      + network_interface_ids                                  = [
          + "/subscriptions/cb97925a-92db-40f8-b51c-fb7b2696545c/resourceGroups/rg-personal-dev-eastus2/providers/Microsoft.Network/networkInterfaces/nic-vm-personal-dev-eastus2",
        ]
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-personal-dev-eastus2"
      + secure_boot_enabled                                    = true
      + size                                                   = "Standard_B2s"
      + tags                                                   = {
          + "cost_center" = "personal"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "matt.bouges@gmail.com"
          + "project"     = "personal"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)
      + vtpm_enabled                                           = true

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 128
          + id                        = (known after apply)
          + name                      = "osdisk-vm-personal-dev-eastus2"
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "windows-11"
          + publisher = "MicrosoftWindowsDesktop"
          + sku       = "win11-24h2-ent"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mbouges, Action: `pull_request`*